---
kind: method
id: M:Autodesk.Revit.DB.FailureResolution.Dispose
source: html/95f5bc5b-aefe-7fb9-9200-074b8a77a3e3.htm
---
# Autodesk.Revit.DB.FailureResolution.Dispose Method

Releases all resources used by the FailureResolution

## Syntax (C#)
```csharp
public void Dispose()
```